gearsincorg/BookBook/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESP_WIFI_PS_NONE=y
CONFIG_SPIRAM_USE_MALLOC=y

# 1 ms scheduler tick: the LED spinner steps every ~83 ms and a 10 ms tick made it visibly uneven.
CONFIG_FREERTOS_HZ=1000

# TLS buffers in PSRAM. Each secure connection needs two ~16 KB buffers; with the library and Claude
# connections kept open, the fast internal RAM ran out ("mbedtls_ssl_setup returned -0x7F00", largest free
# block 15 KB) and speech-to-text could not connect ("I could not reach the speech service").
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=8192
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# touch.cpp uses the legacy touch driver (driver/touch_pad.h), as PhilbotSays does; silence its
# deprecation #warning since we are using it deliberately.
CONFIG_TOUCH_SUPPRESS_DEPRECATE_WARN=y
